In [1]:
a=10
b=20
c=a+b
print(c)

30

In [ ]:
## Exploratory Data analysis(EDA):

- we have 4 important packages or modules available

- pandas 

    - Data Frame operations

- numpy

    - numerical opeations

- matplotlib

    - for plotting

- seaborn

    - for plotting

In [ ]:
==============================EDA===================================
1) pandas                    :   Data frame operations
2) numpy                     :   math operations
3) matplotlib                :   plotting or graphs
4) seaborn                   :   plotting or graphs
5) plotly                    :   plotting or graphs
6) bokhe                     :   plotting or graphs

====================== Machine learning ==========================
7) sickit-learn(sklean)      :   For ALL ML algorithms 
8) stats                     :   some statistical operations 

====================== Deep learning ================================
9) Tensorflow                :   Deep learning models (Google)
10) keras                    :   Deep learning models tensorflow as backend
11) pytorch                  :   Deep learning models (Meta)
12) opencv                   :   Image and Video opeartions
13) pillow                   :   Image operations

=================== Object Detection models(Transfer learning)========================
14) Mobilenet                :   Deep learning packages
15) VGGnet                   :   Deep learning packages
16) Resnet                   :   Deep learning packages
17) Inceptionv3              :   Deep learning packages
18) YOLO                     :   Deep learning packages

====================== Natural Language process ===============================
19) NLTK                     :   Natural Langauge Tool Kit
20) SpCy                     :   Alternative to NLTK
21) Wordcloud                :   Text representation

======================= NLP word Embedding Models ==============================
22) Word2Vec                 :   Google
23) GloVe                    :   Stanford
24) Fasttext                 :   Meta(Face book)

====================== ALLEN NLP (organization) ===========================
25) NLP applications         :  Pyspark as Backend

======================= Optical Character Recognition(OCR) ===============
Extract the text from the image
26) Tesseract
27) easyocr

=========================BERT=======================================
BERT: Bi directional Encoded Representations from Transformers
28) Transformers          : Hugging face (Google)

==================== WebScrapping ===========================
29) SQLITE                 : Connect the Database using python
30) Selenium
31) Beautiful soup
32) Regex

===================== GenAI and LLM =============================
33) Langchain             :  To Connect all  LLM models
34) GPT                   :  OpenAI
35) Gemini                :  Google
36) Llama                 :  Meta
37) Grok                  :  XAi
38) BedRock               :  Amazon
39) Claude AI             :  Anthropic

=================== Agentic AI==================================
40) Langraph
41) CrewAI
42) Phidata
43) Autogen
==================== API creation==============================
44) Flask
45) FastAPI
46) Gradio
47) Django 

===================== WebAppliaction ===========================
48) Streamlit

======================= Model deployment(MLops) ==============================
49) mlflow
50) Kubeflow

========================== Cloud AI =========================================
51) Azure Cognitive services
52) Azure ML Studio
53) GCP vertexAI
54) AWS Sagemaker

=============================== Extra ========================================
55) random
56) time
57) math
58) logging
59) warnings
60) date

**Step-1: import packages**

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**Step-2:Create a Dataframe using List**

In [2]:
names=['Ramesh','Suresh','Mahesh']
pd.DataFrame(names)

        0
0  Ramesh
1  Suresh
2  Mahesh

In [3]:
names=['Ramesh','Suresh','Mahesh']
age = [20,21,22]

pd.DataFrame(zip(names,age))

        0   1
0  Ramesh  20
1  Suresh  21
2  Mahesh  22

In [4]:
names=['Ramesh','Suresh','Mahesh']
age = [20,21,22]
city=['Hyd','Mumbai','Pune']

pd.DataFrame(zip(names,age,city))

        0   1       2
0  Ramesh  20     Hyd
1  Suresh  21  Mumbai
2  Mahesh  22    Pune

**Step-3:Insert the columns**

- column value excpect an Index or array-like

In [6]:
names=['Ramesh','Suresh','Mahesh']
pd.DataFrame(names,columns=['Names'])

    Names
0  Ramesh
1  Suresh
2  Mahesh

In [7]:
names=['Ramesh','Suresh','Mahesh']
age = [20,21,22]
city=['Hyd','Mumbai','Pune']
cols=['Names','Age','City']
pd.DataFrame(zip(names,age,city),
            columns=cols)

    Names  Age    City
0  Ramesh   20     Hyd
1  Suresh   21  Mumbai
2  Mahesh   22    Pune

**Step-4: Modify the index**

In [13]:
names=['Ramesh','Suresh','Mahesh']
age = [20,21,22]
city=['Hyd','Mumbai','Pune']
cols=['Names','Age','City']
idx=['A','B','C']
df1=pd.DataFrame(zip(names,age,city),
             index=idx,
            columns=cols)

In [15]:
df1

    Names  Age    City
A  Ramesh   20     Hyd
B  Suresh   21  Mumbai
C  Mahesh   22    Pune

In [11]:
type(df1)

pandas.core.frame.DataFrame

- index length should be match with number of rows

- columns length should be natch with number of cols

**Step-5: Create a Dataframe using Dictionary**

In [5]:
d={'Names':['Ramesh','Suresh','Mahesh'],
  'Age':[20,21,22],
  'City':['Hyd','Mumbai','Pune']}
pd.DataFrame(d)

# keys behave as column names
# no need of explitly mention

    Names  Age    City
0  Ramesh   20     Hyd
1  Suresh   21  Mumbai
2  Mahesh   22    Pune

**Step-6: Create a DataFrame using Scalar values means with out list**

In [5]:
d={'Names':'Ramesh',
  'Age':20,
  'City':'Hyd'}
pd.DataFrame(d)

ValueError: If using all scalar values, you must pass an index

In [9]:
d={'Names':'Ramesh',
  'Age':20,
  'City':'Hyd'}
pd.DataFrame(d,index=[1,2])

    Names  Age City
1  Ramesh   20  Hyd
2  Ramesh   20  Hyd

**Step-7: Data quick cheks**

- shape

- size

- len

- columns

- dtypes

In [22]:
df1

    Names  Age    City
A  Ramesh   20     Hyd
B  Suresh   21  Mumbai
C  Mahesh   22    Pune

In [24]:
df1.shape

(3, 3)

In [26]:
df1.size

9

In [28]:
df1.dtypes

Names    object
Age       int64
City     object
dtype: object

In [30]:
len(df1)

3

**Step-8: Add data to empty dataframe**

In [39]:
d1=pd.DataFrame()
d1['Names']=['Ramesh','Suresh','Sathish']
d1['Age']=[20,21,22]
d1

     Names  Age
0   Ramesh   20
1   Suresh   21
2  Sathish   22

**Step-9: Add data to already Existed Dataframe**

- df1 alreday has a data with columns Names, Age, City

- Now we want to create a new column with Marks

In [41]:
df1

    Names  Age    City
A  Ramesh   20     Hyd
B  Suresh   21  Mumbai
C  Mahesh   22    Pune

In [44]:
df1['Marks']=[100,200,300]
df1

    Names  Age    City  Marks
A  Ramesh   20     Hyd    100
B  Suresh   21  Mumbai    200
C  Mahesh   22    Pune    300

**Step-10: How to update the column values**

- if you want to add the new column to empty dataframe

- if you want to add the new column to already existed dataframe

- if you want to modify the data of a specific column

- syntax is same

- df[colname]=[data]

In [51]:
df1.columns

Index(['Names', 'Age', 'City', 'Marks'], dtype='object')

In [55]:
df1['City']=['Delhi','Chennai','Hyd']
df1['city']=['Delhi','Chennai','Hyd']
df1

    Names  Age     City  Marks     city
A  Ramesh   20    Delhi    100    Delhi
B  Suresh   21  Chennai    200  Chennai
C  Mahesh   22      Hyd    300      Hyd

**Step-11: How to Drop the specific column**

- by default axis=0 represents index

- if you provide the column change axis=1

- inplace=True then Data frame will be overwrite

In [68]:
df1.drop('city',
         axis=1,
        inplace=True)

In [70]:
df1

    Names  Age     City  Marks
A  Ramesh   20    Delhi    100
B  Suresh   21  Chennai    200
C  Mahesh   22      Hyd    300

In [72]:
df1['age']=[20,30,40]
df1

    Names  Age     City  Marks  age
A  Ramesh   20    Delhi    100   20
B  Suresh   21  Chennai    200   30
C  Mahesh   22      Hyd    300   40

In [76]:
df1.drop(columns='age',inplace=True)

In [78]:
df1

    Names  Age     City  Marks
A  Ramesh   20    Delhi    100
B  Suresh   21  Chennai    200
C  Mahesh   22      Hyd    300

In [80]:
df1['age']=[20,30,40]
df1['city']=['D','C','P']
df1

    Names  Age     City  Marks  age city
A  Ramesh   20    Delhi    100   20    D
B  Suresh   21  Chennai    200   30    C
C  Mahesh   22      Hyd    300   40    P

In [82]:
df1.drop(['age','city'],axis=1)

    Names  Age     City  Marks
A  Ramesh   20    Delhi    100
B  Suresh   21  Chennai    200
C  Mahesh   22      Hyd    300

In [19]:
df1.drop(columns=['Age'])

    Names    City
A  Ramesh     Hyd
B  Suresh  Mumbai
C  Mahesh    Pune

In [88]:
df1.drop(['A'])

    Names  Age     City  Marks  age city
B  Suresh   21  Chennai    200   30    C
C  Mahesh   22      Hyd    300   40    P

In [90]:
df1.drop(labels=['A'])

    Names  Age     City  Marks  age city
B  Suresh   21  Chennai    200   30    C
C  Mahesh   22      Hyd    300   40    P

In [92]:
df1

    Names  Age     City  Marks  age city
A  Ramesh   20    Delhi    100   20    D
B  Suresh   21  Chennai    200   30    C
C  Mahesh   22      Hyd    300   40    P

**Step-12: Rename the column**

- create a dictionary key as old name value as new name

In [96]:
dict1={'Marks':'marks'}
df1.rename(dict1,axis=1)  # dont do inplace

    Names  Age     City  marks  age city
A  Ramesh   20    Delhi    100   20    D
B  Suresh   21  Chennai    200   30    C
C  Mahesh   22      Hyd    300   40    P

In [98]:
df1.rename(columns=dict1)

    Names  Age     City  marks  age city
A  Ramesh   20    Delhi    100   20    D
B  Suresh   21  Chennai    200   30    C
C  Mahesh   22      Hyd    300   40    P

In [100]:
df1.drop(['age','city'],axis=1,inplace=True)

In [104]:
df1.columns=['names','age','city','marks']
df1

    names  age     city  marks
A  Ramesh   20    Delhi    100
B  Suresh   21  Chennai    200
C  Mahesh   22      Hyd    300

**Step-13: Add a new row**

In [107]:
df1

    names  age     city  marks
A  Ramesh   20    Delhi    100
B  Suresh   21  Chennai    200
C  Mahesh   22      Hyd    300

In [ ]:
df1[<colname>]=[v1,v2,v3]
df1.loc[<index>]=[data]

In [109]:
df1.loc['D']=['Manish',25,'Patna',400]

In [111]:
df1

    names  age     city  marks
A  Ramesh   20    Delhi    100
B  Suresh   21  Chennai    200
C  Mahesh   22      Hyd    300
D  Manish   25    Patna    400

**Step-14:Save the dataframe**

In [114]:
df1

    names  age     city  marks
A  Ramesh   20    Delhi    100
B  Suresh   21  Chennai    200
C  Mahesh   22      Hyd    300
D  Manish   25    Patna    400

In [116]:
df1.to_csv('data.csv')

**Step-15:Read the dataframe**

In [119]:
pd.read_csv('data.csv')

  Unnamed: 0   names  age     city  marks
0          A  Ramesh   20    Delhi    100
1          B  Suresh   21  Chennai    200
2          C  Mahesh   22      Hyd    300
3          D  Manish   25    Patna    400

In [121]:
df1.to_csv('data1.csv',index=False)

In [123]:
pd.read_csv('data1.csv')

    names  age     city  marks
0  Ramesh   20    Delhi    100
1  Suresh   21  Chennai    200
2  Mahesh   22      Hyd    300
3  Manish   25    Patna    400

In [125]:
df1.to_excel('data1.xlsx',index=False)  # can you try with excel
pd.read_excel('data1.xlsx')             # read with excel

    names  age     city  marks
0  Ramesh   20    Delhi    100
1  Suresh   21  Chennai    200
2  Mahesh   22      Hyd    300
3  Manish   25    Patna    400